<?php

use App\Models\Play;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PlaysSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('plays')->delete();

        $data = [
            [
                'title' => 'مسرحية زعتر وعنتر في الطريق',
                'slug' => 'مسرحية-زعتر-وعنتر-في-الطريق-1',
                'image' => 'dummy/play1.png',
                'type' => 'play',
                'header_image' => 'dummy/play_header.png',
                'description' => 'مسرحية توعوية للأطفال من جيل 4 حتى 8 سنوات ( بستان حتى رابع ) غنية بالوسائل التوعوية المختلفة جميعها تهدف الى محاورة الاطفال على خشبة المسرح من خلال الاغاني والكوميديا والمشاركة الفاعلة مع الممثلين لعرض السلوك الايجابي ورفض السلوك السلبي, برفض العنف والتهور في الشارع وفي كل مكان . مدة المسرحية 45 دقيقة معدة ل 150 طفل في قاعة مفتوحة او مغلقة',
            ],
            [
                'title' => 'مسرحية زعتر وعنتر في الطريق',
                'slug' => 'مسرحية-زعتر-وعنتر-في-الطريق-2',
                'image' => 'dummy/play2.png',
                'type' => 'play',
                'header_image' => 'dummy/play_header.png',
                'description' => 'مسرحية توعوية للأطفال من جيل 4 حتى 8 سنوات ( بستان حتى رابع ) غنية بالوسائل التوعوية المختلفة جميعها تهدف الى محاورة الاطفال على خشبة المسرح من خلال الاغاني والكوميديا والمشاركة الفاعلة مع الممثلين لعرض السلوك الايجابي ورفض السلوك السلبي, برفض العنف والتهور في الشارع وفي كل مكان . مدة المسرحية 45 دقيقة معدة ل 150 طفل في قاعة مفتوحة او مغلقة',
            ],
            [
                'title' => 'مسرحية زعتر وعنتر في الطريق',
                'slug' => 'مسرحية-زعتر-وعنتر-في-الطريق-3',
                'image' => 'dummy/play3.png',
                'type' => 'play',
                'header_image' => 'dummy/play_header.png',
                'description' => 'مسرحية توعوية للأطفال من جيل 4 حتى 8 سنوات ( بستان حتى رابع ) غنية بالوسائل التوعوية المختلفة جميعها تهدف الى محاورة الاطفال على خشبة المسرح من خلال الاغاني والكوميديا والمشاركة الفاعلة مع الممثلين لعرض السلوك الايجابي ورفض السلوك السلبي, برفض العنف والتهور في الشارع وفي كل مكان . مدة المسرحية 45 دقيقة معدة ل 150 طفل في قاعة مفتوحة او مغلقة',
            ]
        ];

        foreach ($data as $dataItem) {
            $play = new Play();
            $play->fill($dataItem)->save();
        }
    }
}
