<?php

use App\Models\Program;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProgramsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('programs')->delete();

        $data = [
            [
                'name' => 'ورشات الحواس',
                'slug' => 'ورشات-الحواس',
                'description' => 'العديد من الورشات والفعاليات التربوية التثقيفية لشتى الشرائح الطلابية منها بمواضيع الحذر على الطرق وأخرى بمواضيع السلامة والصحة او بمواضيع توعوية للتسامح ونبذ العنف. ورشات عمل وفعاليات تربوية لشتى الاجيال في المدارس, الابتدائية, الاعدادية والثانوية',
                'image' => 'dummy/p4.png'
            ],
            [
                'name' => 'مؤتمرات الحواس',
                'slug' => 'مؤتمرات-الحواس',
                'description' => 'العديد من الورشات والفعاليات التربوية التثقيفية لشتى الشرائح الطلابية منها بمواضيع الحذر على الطرق وأخرى بمواضيع السلامة والصحة او بمواضيع توعوية للتسامح ونبذ العنف. ورشات عمل وفعاليات تربوية لشتى الاجيال في المدارس, الابتدائية, الاعدادية والثانوية',
                'image' => 'dummy/p4.png'
            ],
            [
                'name' => 'محاضرات الحواس',
                'slug' => 'محاضرات-الحواس',
                'description' => 'العديد من الورشات والفعاليات التربوية التثقيفية لشتى الشرائح الطلابية منها بمواضيع الحذر على الطرق وأخرى بمواضيع السلامة والصحة او بمواضيع توعوية للتسامح ونبذ العنف. ورشات عمل وفعاليات تربوية لشتى الاجيال في المدارس, الابتدائية, الاعدادية والثانوية',
                'image' => 'dummy/p4.png'
            ]
        ];
        foreach ($data as $dataItem) {
            $program = new Program();
            $program->fill($dataItem)->save();
        }
    }
}
