<?php

use App\Models\Blog;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BlogsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('blogs')->delete();
        $title = 'سلوك وتصرفات الآباء والأمهات';
        $body = 'سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء

        سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء
        
        سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء
        
        سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء
        
        
        سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في سلوك أبنائهم في الحاضر وفي المستقبل, كانت هذه السلوكيات حكيمة ومسؤولة أو على العكس عشوائية وغير مسؤولة سواء في البيت أو في الشارع أو أثناء
        
        سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي جبارين مدير عام مؤسسة حواس إن التصرفات والسلوكيات التي يقوم بها الآباء والأمهات أمام أبنائهم ما هي إلا تذويت وعمق في';
        $brief = 'سلوك وتصرفات الآباء والأمهات مرآة لتصرفات الأبناء اعداد طائي';
        $slug = 'سلوك-وتصرفات-الآباء-والأمهات-';
        $image = 'dummy/b';

        for ($i = 1; $i <= 8; $i++) {

            $blogSlug = $slug . $i;
            $blogImage = $image . $i . '.png';

            $blog = Blog::firstOrNew(['slug' => $blogSlug, 'image' => $blogImage]);

            if (!$blog->exists) {
                $blog->fill([
                    'title' => $title,
                    'body' => $body,
                    'brief' => $brief,
                    'image' => $blogImage,
                    'slug' => $blogSlug,
                    'show_in_home_page' => $i < 7 ? true : false
                ])->save();
            }
        }
    }
}
